# Hierarchical Indexing

In [1]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series , DataFrame

In [11]:
data = pd.Series(np.random.randn(9),
index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'e'],
[1, 2, 3, 1, 4, 1, 2, 2, 3]])

In [12]:
data

a  1   -1.213765
   2    2.131873
   3   -2.412953
b  1   -1.834191
   4   -0.391834
c  1    0.265674
   2   -1.516835
d  2    0.976635
e  3    0.550410
dtype: float64

In [13]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd', 'e'], [1, 2, 3, 4]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 4], [0, 1, 2, 0, 3, 0, 1, 1, 2]])

In [14]:
data['b']

1   -1.834191
4   -0.391834
dtype: float64

In [16]:
data['a':'c']

a  1   -1.213765
   2    2.131873
   3   -2.412953
b  1   -1.834191
   4   -0.391834
c  1    0.265674
   2   -1.516835
dtype: float64

In [19]:
data[['b','e']]

b  1   -1.834191
   4   -0.391834
e  3    0.550410
dtype: float64

In [20]:
data.loc[:, 2]

a    2.131873
c   -1.516835
d    0.976635
dtype: float64

In [21]:
data[:, 2]

a    2.131873
c   -1.516835
d    0.976635
dtype: float64

In [22]:
data

a  1   -1.213765
   2    2.131873
   3   -2.412953
b  1   -1.834191
   4   -0.391834
c  1    0.265674
   2   -1.516835
d  2    0.976635
e  3    0.550410
dtype: float64

In [23]:
data.unstack()

          1         2         3         4
a -1.213765  2.131873 -2.412953       NaN
b -1.834191       NaN       NaN -0.391834
c  0.265674 -1.516835       NaN       NaN
d       NaN  0.976635       NaN       NaN
e       NaN       NaN  0.550410       NaN

In [24]:
data.unstack().stack()

a  1   -1.213765
   2    2.131873
   3   -2.412953
b  1   -1.834191
   4   -0.391834
c  1    0.265674
   2   -1.516835
d  2    0.976635
e  3    0.550410
dtype: float64

In [25]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
 columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])

In [26]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [28]:
frame1 = pd.DataFrame(np.arange(12).reshape((4, 3)),
 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
 columns=[['Ohio', 'utah', 'Colorado'],['Green', 'Red', 'Green']])

In [29]:
frame1

     Ohio utah Colorado
    Green  Red    Green
a 1     0    1        2
  2     3    4        5
b 1     6    7        8
  2     9   10       11

In [30]:
frame.index.names = ['key1', 'key2']

In [31]:
frame.columns.names = ['state', 'color']

In [32]:
 frame

state      Ohio utah Colorado
color     Green  Red    Green
key1 key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11

In [33]:
frame['Ohio']

color      Green
key1 key2
a    1         0
     2         3
b    1         6
     2         9